{
  "To Kill a Mockingbird": [
    "Injustice",
    "Moral lessons",
    "Confronting deep prejudice",
    "Children question societal wrongs",
    "A child's view of morality",
    "Innocence shattered by unfair verdict",
    "A court case reveals deep divisions",
    "An innocent person faces unjust condemnation",
    "A small community wrestles with racism and morality",
    "Childhood innocence is slowly eroded by societal injustices",
    "A story of growth, morality, and confronting racial injustices",
    "Through the eyes of children, society's flaws and moral struggles are laid bare."
  ],
  "1984": [
    "Oppression",
    "Totalitarian control",
    "Surveillance dominates life",
    "Individuality crushed by authority",
    "A future where thoughts are monitored",
    "A bleak vision of controlled existence",
    "Freedom is an illusion under total power",
    "Truth becomes malleable under oppressive regime",
    "Rebellion is short-lived in a world of surveillance",
    "The human spirit is slowly broken by total control",
    "A society where truth, freedom, and love are sacrificed",
    "A grim depiction of a world ruled by manipulation, fear, and repression."
  ],
  "The Catcher in the Rye": [
    "Alienation",
    "Youthful disillusionment",
    "A search for meaning",
    "Struggling to find direction",
    "A young mind in turmoil",
    "Disconnection from the adult world",
    "A journey through confusion and rebellion",
    "Struggling against the phoniness of society",
    "A quest for identity amidst deep isolation",
    "A troubled mind resists the transition to adulthood",
    "A young person seeks truth, struggling against superficiality",
    "An individual battles emotional turmoil and isolation while resisting conformity."
  ],
  "The Lord of the Rings": [
    "Power",
    "Good versus evil",
    "A quest for salvation",
    "The journey to destroy power",
    "A battle to resist ultimate temptation",
    "The fight to protect a fragile world",
    "A dangerous journey to save civilization from darkness",
    "The struggle between light and darkness, hope and despair",
    "A group of unlikely heroes fights against overwhelming odds",
    "A quest to end a tyrannical force threatening the world's future",
    "An epic journey through lands of danger and beauty to defeat evil",
    "A monumental struggle to destroy the embodiment of power and save the world."
  ],
  "The Great Gatsby": [
    "Yearning",
    "Tragic aspiration",
    "Illusion of wealth",
    "Chasing an unreachable dream",
    "A tragic pursuit of lost love",
    "The emptiness behind lavish excess",
    "Wealth and ambition hide painful truths",
    "A facade of success crumbles under unrequited desire",
    "A man's obsession with the past leads to downfall",
    "Dreams of grandeur are shattered by reality's harshness",
    "The pursuit of love, status, and wealth ends in destruction",
    "A dreamer's quest for wealth and love unravels in the face of reality."
  ],
  "The Lion, the Witch, and the Wardrobe": [
    "Discovery",
    "Hidden world",
    "Entering a magical realm",
    "Children discover an enchanted kingdom",
    "A magical land under eternal winter",
    "Children stumble upon a world of wonder",
    "A struggle to end an evil rule over magic",
    "Innocent explorers find themselves in a battle of good and evil",
    "A cold kingdom awaits its liberators from an icy curse",
    "A magical land trapped in winter is saved by unexpected heroes",
    "A world hidden in plain sight reveals dangers and wonders beyond imagination",
    "Children discover a magical world locked in an icy spell and fight to free it."
  ],
  "Lord of the Flies": [
    "Chaos",
    "Society crumbles",
    "Order descends into madness",
    "A group descends into savagery",
    "Civilization erodes as chaos reigns",
    "Innocence is lost through unchecked power",
    "Boys' attempt at order turns to violent chaos",
    "Survival leads to savagery in an isolated environment",
    "Without rules, a group loses its moral compass",
    "A descent from innocence to barbarism when order disappears",
    "A reflection on the fragile balance between civilization and savagery",
    "A group of young survivors lose their humanity as chaos takes over."
  ],
  "Animal Farm": [
    "Revolution",
    "Power corrupts",
    "Equality turns to tyranny",
    "Uprising against oppressive authority fails",
    "A movement for justice becomes corrupt",
    "Leaders betray their original ideals for power",
    "The oppressed overthrow rulers, only to become tyrants",
    "Revolution's promise of freedom devolves into new oppression",
    "A quest for equality leads to the rise of new dictators",
    "A cycle of revolution shows how power corrupts even the noble",
    "The hope for a just society collapses as leaders mirror former oppressors",
    "The revolution's noble ideals are destroyed as new rulers become equally tyrannical."
  ],
  "Catch-22": [
    "Absurdity",
    "Logic defied",
    "Bureaucracy undermines reason",
    "Caught in a paradox of survival",
    "Sanity becomes insanity in a war zone",
    "A struggle against an absurd system of rules",
    "A soldier's survival depends on impossible contradictions",
    "Bureaucratic madness threatens sanity and survival in wartime",
    "A world where rules defy logic and entrap its participants",
    "The quest to survive war is made impossible by absurd regulations",
    "The chaotic nature of war is compounded by illogical and self-defeating systems",
    "A soldier trapped in a world of paradoxes fights for survival amidst bureaucratic absurdity."
  ],
  "The Grapes of Wrath": [
    "Struggle",
    "Family's hardship",
    "Displacement and survival",
    "Family's fight against economic ruin",
    "The fight to survive during hard times",
    "Seeking dignity in the face of despair",
    "A family's journey across a barren landscape",
    "The quest for hope amidst extreme poverty and hardship",
    "A displaced family seeks survival during an economic disaster",
    "A family's resilience and endurance through poverty and displacement",
    "A relentless fight for survival in the midst of economic collapse and despair",
    "A displaced family battles poverty, injustice, and hardship during an unforgiving journey."
  ],
  "Gone with the Wind": [
    "War",
    "Love lost",
    "Survival and resilience",
    "Enduring tragedy and love",
    "A woman's struggle for survival",
    "Surviving through war and heartbreak",
    "A woman's quest for survival amidst turmoil",
    "Facing the collapse of a way of life and love",
    "A story of resilience and heartbreak in changing times",
    "A life of passion and loss unfolds during a time of war",
    "A woman's determination to survive amidst personal and historical upheaval",
    "Through loss, war, and love, a woman survives by sheer will in a changing world."
  ]
}
